cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "heroku/brew"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"

# DB
brew "mongodb", restart_service: true
brew "redis", restart_service: true

# Editors
brew "vim"

# Config management
brew "ansible"

# Terminal
brew "asciinema"
brew "cmake"
brew "ctags"
brew "fzf"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-completions"

# App hosting
brew "heroku/brew/heroku"

# Virtual environment

# Package manager
brew "mas"
brew "yarn"

# Archiving
brew "p7zip"

# Casks
cask "alfred"
cask "cleanmymac"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "postman"
cask "skype"
cask "slack"
cask "robo-3t"
cask "teamviewer"
cask "tunnelblick"
cask "transmission"
cask "vlc"
cask "xld"
cask "yandexdisk"
cask "zeplin"

# Mac App Store
mas "1Password", id: 443987910
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "Wunderlist", id: 410628904
mas "Evernote", id: 406056744
mas "Telegram", id: 747648890
